'''코딩
컴퓨터에게 동작을 시키기 위한 명령

프로그래밍에서는 두 가지가 제일 중요하다
1. 동작원리, 2. 구현 방법

1. 동작원리
클라이언트(주문하는 손님)쪽 코드, 서버(제공해주는 역할)쪽 코드 이렇게 나뉜다


-(웹 개발에서의)클라이언트 : 크롬, 사파리
브라우저가 우리에게 웹사이트를 보여주기 위해서는 html, css, jabascript code가 필요하다
html : 이미지, 글자, 버튼 등이 어디에 들어갈 지 정해주는 역할
css : html에 크기, 색깔, 테두리 선의 굵기 등의 스타일을 입혀주는 역할
js : 클릭하거나 스크롤하거나 등의 유저 동작에 따라 사이트가 어떻게 반응할지 정해주는 역할

이 코드들이 내 컴퓨터에 있으면 바로 사이트를 띄울 수 있을텐데 다 갖고 있을 수는 없다
코드들은 어디서 오는 걸까? > 클라이언트와 서버를 이해하면 알 수 있다

웹사이트를 보여주기 위한 코드는 서버에서 온다
-서버 : 또다른 개념의 컴퓨터
유튜브=구글이 유튜브를 지원하기 위해 항상 켜 놓는 서버 컴퓨터가 있는 셈
우리가 유튜브를 보고 싶을 땐 이 서버에 유튜브 사이트를 보여주세요 요청하는 것이다

'''