#빈 자리는 빈공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}".format(500))#양수일 때는 +없이 정수출력
#부등호가 정렬하는 방향
#양수일 때는 +로 표시, 음수일 때는 -로 표시
print("{0: >+10}".format(500))
print("{0: >+10}".format(-500))

#왼쪽 정렬하고, 빈 칸을 _로 채움
print("{0:_<+10}".format(500))
#10 앞에 +를 넣었기 때문에 양수일 땐 +, 음수일 땐 - 표시
#+를 지우면 정수만 출력

#3자리 마다 콤마 찍어주기
print("{0:,}".format(100000000000000000))

#3자리 마다 콤마 찍어주기, +-부호도 붙여주기
print("{0:+,}".format(100000000000000000))
print("{0:+,}".format(-100000000000000000))

#3자리 마다 콤마 찍어주기, +-부호도 붙이고, 자릿수 확보하기
#빈 자리는 ^로 채우기
print("{0:^<+30,}".format(100000000000000))

#소수점 출력
print("{0:f}".format(5/3))

#소수점을 특정 자리수까지만 표시
print("{0:.2f}".format(5/3))